*** Sampling to simulate prediction
Generating implied observations from a model is useful for four reasons:
1. /Model checking/ 
Model checking means: 
- ensuring the model fitting worked correctly
how well does the model reproduce the data used to educate it.

- evaluating the adequacy of a model for some purpose
asses how the model fails to describe the data, as a path towards model comprehension,
revision and improvement.
for each possible value of $p$, there is an implied distribution of outcomes. > posterior
predictive distribution. 
2. /Software validation/
3. /Research design/
4. /Forecasting/

Likelihood functions work in both directions (Bayesian models are /generative/):
1. They allow us to infer the plausibility of each possible value of $p$, after
   observation
2. They also allow us to simulate the observations that the model implies

Samples from the posterior distribution can be used to produce intervals, point estimates,
posterior predictive checks. 

Posterior predictive checks combine uncertainty about parameters, as described by the
posterior distribution, with uncertainty about outcomes, as described by the assumed
likelihood function.

#+name: samples
#+BEGIN_SRC R 
p_grid <- seq(from=0, to=1, length.out=1000)
prior <- rep(1, 1000)
likelihood <- dbinom(6, size=9, prob=p_grid)
posterior <- likelihood * prior
posterior <- posterior / sum(posterior)
set.seed(100)
samples <- sample(p_grid, prob=posterior, size=1e4, replace=TRUE)

#3E1
mean(samples < 0.2)

#3E2
mean(samples > 0.8)

#+END_SRC

#+RESULTS:
: 0.1117

#+BEGIN_SRC R :3E1 input=samples
mean(samples < 0.2)

#+END_SRC

#+RESULTS:
